//* JCL FOR COMPILING ASSEMBLY                                     *
//*                                                                *
//TUTORIA1 JOB (),CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
// REGION=4M
//STEP1 EXEC ASMACL
//C.SYSLIB DD
//         DD DSN=MOSHIX.TUTORIAL.SOURCE,DISP=SHR
//C.SYSIN  DD DSN=MOSHIX.TUTORIAL.SOURCE(ISPCLEAR),DISP=SHR
//L.SYSLMOD DD DSN=MOSHIX.TUTORIAL.LOAD,DISP=SHR
//L.SYSIN DD *
 NAME ISPCLEAR(R)
/*
