 /* REXX ***  */ 
  DO FOREVER 
   BCIN    = " " 
   BCOUT   = " " 
   ZCMD    = "COMMAND" 
   "ISPEXEC DISPLAY PANEL(CALC)" 
   IF ZCMD = "CANCEL" THEN DO /* LET THE USER OUT WITH THE CANCEL COMMAND IN THE COMMAND PROMPT */
     EXIT 0 
   END 
   IF RC <> 0 THEN EXIT 
   INTERPRET "BCOUT  = " BCIN 
   "ISPEXEC DISPLAY PANEL(CALC)" 
 END 
